INSERT INTO `quest_objectives` VALUES (289477, 26320, 0, 0, 42371, 1, 1, 0, 0, NULL, 23360);
INSERT INTO `quest_objectives_locale` VALUES (289477, 'ruRU', 26320, 0, 'Видение прошлого раскрыто', 19865);
UPDATE `gameobject_template` SET displayId = 299, Data1 = 30, Data3 = 1, Data4 = 26320, Data6= -1 WHERE entry = 204039;
DELETE FROM `gameobject` WHERE `guid`= 301116;
INSERT INTO `gameobject` VALUES (301116, 204039, 36, 0, 0, 6, 0, 0, -15.7351, -380.341, 61.2262, 0, 0, 0, 0, 0, 300, 255, 1, '', 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=1;
INSERT INTO `waypoint_data` VALUES (426930, 1, -96.5208, -701.323, 26.2372, 0, 0, 0, 0, 100, 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=2;
INSERT INTO `waypoint_data` VALUES (426930, 2, -72.3125, -732.918, 34.7095, 0, 0, 0, 0, 100, 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=3;
INSERT INTO `waypoint_data` VALUES (426930, 3, -40.2812, -763.783, 43.5428, 0, 0, 0, 0, 100, 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=4;
INSERT INTO `waypoint_data` VALUES (426930, 4, -2.125, -818.701, 57.0428, 0, 0, 0, 0, 100, 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=5;
INSERT INTO `waypoint_data` VALUES (426930, 5, -27.658, -850.71, 57.0428, 0, 0, 0, 0, 100, 0);
DELETE FROM `waypoint_data` WHERE `id`=426930 AND `point`=6;
INSERT INTO `waypoint_data` VALUES (426930, 6, -63.1719, -829.318, 47.6816, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4237100;
INSERT INTO waypoint_data VALUES 
(4237100, 0, -82.94046, -819.675, 39.62264, 0, 0, 0, 0, 100, 0),
(4237100, 1, -84.28472, -819.6649, 39.60331, 0, 0, 0, 0, 100, 0),
(4237100, 2, -83.28472, -819.6649, 39.60331, 0, 0, 0, 0, 100, 0),
(4237100, 3, -79.30035, -819.7813, 39.82702, 0, 0, 0, 0, 100, 0),
(4237100, 4, -74.83334, -819.8941, 40.20089, 0, 0, 0, 0, 100, 0),
(4237100, 5, -74.83334, -819.8941, 40.20089, 0, 0, 0, 0, 100, 0),
(4237100, 6, -70.08977, -820.5098, 40.77253, 0, 0, 0, 0, 100, 0),
(4237100, 7, -67.84621, -821.1254, 40.84417, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4269900;
INSERT INTO waypoint_data VALUES 
(4269900, 0, -63.56937, -819.5765, 41.2412, 0, 0, 0, 0, 100, 0),
(4269900, 1, -65.17618, -829.6771, 41.15453, 0, 0, 0, 0, 100, 0),
(4269900, 2, -65.78299, -839.7778, 41.06787, 0, 0, 0, 0, 100, 0),
(4269900, 3, -67.7309, -845.127, 32.6046, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4270000;
INSERT INTO waypoint_data VALUES 
(4270000, 0, -62.84618, -820.1375, 41.30676, 0, 0, 0, 0, 100, 0),
(4270000, 1, -61.30417, -826.679, 41.53063, 0, 0, 0, 0, 100, 0),
(4270000, 2, -63.05417, -836.679, 41.53063, 0, 0, 0, 0, 100, 0),
(4270000, 3, -63.76215, -839.7205, 41.2545, 0, 0, 0, 0, 100, 0),
(4270000, 4, -63.8767, -845.486, 32.9145, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4270100;
INSERT INTO waypoint_data VALUES 
(4270100, 0, -62.91118, -821.7435, 41.30499, 0, 0, 0, 0, 100, 0),
(4270100, 1, -66.62847, -839.632, 40.98961, 0, 0, 0, 0, 100, 0),
(4270100, 2, -66.1233, -845.115, 32.724, 0, 0, 0, 0, 100, 0),
(4270100, 3, -62.51983, -831.6877, 41.6473, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4270200;
INSERT INTO waypoint_data VALUES 
(4270200, 0, -63.03794, -820.5649, 41.28989, 0, 0, 0, 0, 100, 0),
(4270200, 1, -62.64757, -839.6285, 41.35745, 0, 0, 0, 0, 100, 0),
(4270200, 2, -63.1632, -844.773, 32.9248, 0, 0, 0, 0, 100, 0),
(4270200, 3, -60.59276, -831.0967, 41.82367, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4270300;
INSERT INTO waypoint_data VALUES 
(4270300, 0, -63.83944, -819.2853, 41.21694, 0, 0, 0, 0, 100, 0),
(4270300, 1, -63.16104, -824.7407, 41.42934, 0, 0, 0, 0, 100, 0),
(4270300, 2, -63.91104, -830.7407, 41.42934, 0, 0, 0, 0, 100, 0),
(4270300, 3, -64.98264, -839.6962, 41.14175, 0, 0, 0, 0, 100, 0),
(4270300, 4, -63.9601, -845.21, 32.8916, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4269700;
INSERT INTO waypoint_data VALUES 
(4269700, 0, -79.7884, -819.5851, 40.12569, 0, 0, 0, 0, 100, 0),
(4269700, 1, -76.5384, -819.5851, 40.12569, 0, 0, 0, 0, 100, 0),
(4269700, 2, -69.5384, -819.3351, 40.87569, 0, 0, 0, 0, 100, 0),
(4269700, 3, -66.70701, -819.2744, 40.95092, 0, 0, 0, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4269801;
INSERT INTO waypoint_data VALUES 
(4269801, 0, -76.25556, -818.0201, 40.48545, 0, 0, 1, 0, 100, 0),
(4269801, 1, -72.25556, -817.2701, 40.48545, 0, 0, 1, 0, 100, 0),
(4269801, 2, -70.25556, -816.5201, 40.73545, 0, 0, 1, 0, 100, 0),
(4269801, 3, -66.70383, -816.943, 40.95212, 0, 0, 1, 0, 100, 0);
DELETE FROM waypoint_data WHERE id=4269802;
INSERT INTO waypoint_data VALUES 
(4269802, 0, -76.25556, -821.0201, 40.48545, 0, 0, 1, 0, 100, 0),
(4269802, 1, -72.25556, -821.2701, 40.48545, 0, 0, 1, 0, 100, 0),
(4269802, 2, -70.25556, -821.5201, 40.73545, 0, 0, 1, 0, 100, 0),
(4269802, 3, -66.70383, -821.943, 40.95212, 0, 0, 1, 0, 100, 0);
DELETE FROM `creature` WHERE  `guid`=4018;
DELETE FROM `creature_template` WHERE `entry`=42693;
INSERT INTO `creature_template` VALUES (42693, 0, 0, 0, 0, 0, 169, 11686, 0, 0, 'Vision of the Past', '', '', '', 0, 1, 1, 0, 0, 0, 35, 0, 1, 1.14286, 1, 0, 0, 2000, 2000, 1, 1, 1, 131840, 2048, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 916, 0, 0, '', 0, 7, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 'npc_vision_of_the_past', 23420);
UPDATE `creature_text` SET sound = 5783 WHERE entry = 42697 AND groupid = 3;
UPDATE `creature_text` SET sound = 5782 WHERE entry = 42697 AND groupid = 2;
UPDATE `creature_text` SET sound = 5780 WHERE entry = 42697 AND groupid = 0;
UPDATE `creature_text` SET sound = 5784 WHERE entry = 42697 AND groupid = 4;
